; domain
; move precondition updated to prevent moving from and to the same location
(define (domain briefcase)
(:requirements :typing :negative-preconditions :conditional-effects)
(:types portable location)
(:predicates (at ?y - portable ?x - location)
             (in ?x - portable)
             (is-at ?x - location))


(:action move
  :parameters (?m ?l - location)
  :precondition  (and (is-at ?m)(not (is-at ?l)))
  :effect (and (is-at ?l) (not (is-at ?m))
		    (forall (?x - portable) (when (in ?x)
		      (and (at ?x ?l) (not (at ?x ?m)))))))

  (:action take-out
      :parameters (?x - portable)
      :precondition (in ?x)
      :effect (not (in ?x)))
      
  (:action put-in
      :parameters (?x - portable ?l - location)
      :precondition (and (not (in ?x)) (at ?x ?l) (is-at ?l))
      :effect (in ?x)))

; problem
(define (problem briefcase-o5)
(:domain briefcase)
(:objects l0 l1 l2 l3 l4 l5 - location
          o0 o1 o2 o3 o4 - portable)
(:init
(at o0 l2)
(at o1 l0)
(at o2 l3)
(at o3 l4)
(at o4 l0)
(is-at l1)
)
(:goal
(and
(at o0 l5)
(at o1 l1)
(at o2 l1)
(at o3 l5)
(at o4 l5)
(is-at l0)
)
)
)

; plan
1. (move l1 l0)
   deleted: (is-at l1)
   added: (is-at l0)
   goals met: 1 of 6
2. (move l0 l2)
   deleted: (is-at l0)
   added: (is-at l2)
   goals met: 0 of 6
3. (put-in o0 l2)
   added: (in o0)
   goals met: 0 of 6
4. (move l2 l3)
   deleted: (is-at l2) (at o0 l2)
   added: (is-at l3) (at o0 l3)
   goals met: 0 of 6
5. (put-in o2 l3)
   added: (in o2)
   goals met: 0 of 6
6. (move l3 l0)
   deleted: (is-at l3) (at o0 l3) (at o2 l3)
   added: (is-at l0) (at o0 l0) (at o2 l0)
   goals met: 1 of 6
7. (put-in o1 l0)
   added: (in o1)
   goals met: 1 of 6
8. (move l0 l4)
   deleted: (is-at l0) (at o0 l0) (at o1 l0) (at o2 l0)
   added: (is-at l4) (at o0 l4) (at o1 l4) (at o2 l4)
   goals met: 0 of 6
9. (put-in o3 l4)
   added: (in o3)
   goals met: 0 of 6
10. (move l4 l0)
   deleted: (is-at l4) (at o0 l4) (at o1 l4) (at o2 l4) (at o3 l4)
   added: (is-at l0) (at o0 l0) (at o1 l0) (at o2 l0) (at o3 l0)
   goals met: 1 of 6
11. (move l0 l5)
   deleted: (is-at l0) (at o0 l0) (at o1 l0) (at o2 l0) (at o3 l0)
   added: (is-at l5) (at o0 l5) (at o1 l5) (at o2 l5) (at o3 l5)
   goals met: 2 of 6
12. (take-out o3)
   deleted: (in o3)
   goals met: 2 of 6
13. (move l5 l0)
   deleted: (is-at l5) (at o0 l5) (at o1 l5) (at o2 l5)
   added: (is-at l0) (at o0 l0) (at o1 l0) (at o2 l0)
   goals met: 2 of 6
14. (put-in o4 l0)
   added: (in o4)
   goals met: 2 of 6
15. (move l0 l1)
   deleted: (is-at l0) (at o0 l0) (at o1 l0) (at o2 l0) (at o4 l0)
   added: (is-at l1) (at o0 l1) (at o1 l1) (at o2 l1) (at o4 l1)
   goals met: 3 of 6
16. (take-out o2)
   deleted: (in o2)
   goals met: 3 of 6
17. (move l1 l0)
   deleted: (is-at l1) (at o0 l1) (at o1 l1) (at o4 l1)
   added: (is-at l0) (at o0 l0) (at o1 l0) (at o4 l0)
   goals met: 3 of 6
18. (take-out o1)
   deleted: (in o1)
   goals met: 3 of 6
19. (move l0 l5)
   deleted: (is-at l0) (at o0 l0) (at o4 l0)
   added: (is-at l5) (at o0 l5) (at o4 l5)
   goals met: 4 of 6
20. (take-out o4)
   deleted: (in o4)
   goals met: 4 of 6
21. (take-out o0)
   deleted: (in o0)
   goals met: 4 of 6
22. (move l5 l0)
   deleted: (is-at l5)
   added: (is-at l0)
   goals met: 5 of 6
23. (put-in o1 l0)
   added: (in o1)
   goals met: 5 of 6
24. (move l0 l1)
   deleted: (is-at l0) (at o1 l0)
   added: (is-at l1) (at o1 l1)
   goals met: 5 of 6
25. (take-out o1)
   deleted: (in o1)
   goals met: 5 of 6
26. (move l1 l0)
   deleted: (is-at l1)
   added: (is-at l0)
   goals met: 6 of 6
